<a href="https://colab.research.google.com/github/armandovl/youtube/blob/main/tablas_distribucion_frecuencia_video.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
## Importar las librerías de cajón
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
#importamos el data frame
titanic=sns.load_dataset("titanic")

In [3]:
titanic.head(8)

   survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0         0       3    male  22.0  ...   NaN  Southampton     no  False
1         1       1  female  38.0  ...     C    Cherbourg    yes  False
2         1       3  female  26.0  ...   NaN  Southampton    yes   True
3         1       1  female  35.0  ...     C  Southampton    yes  False
4         0       3    male  35.0  ...   NaN  Southampton     no   True
5         0       3    male   NaN  ...   NaN   Queenstown     no   True
6         0       1    male  54.0  ...     E  Southampton     no   True
7         0       3    male   2.0  ...   NaN  Southampton     no  False

[8 rows x 15 columns]

In [4]:
titanic_nuevo=titanic[["survived","pclass","sex","alone"]]

In [5]:
titanic_nuevo.head(6)

   survived  pclass     sex  alone
0         0       3    male  False
1         1       1  female  False
2         1       3  female   True
3         1       1  female  False
4         0       3    male   True
5         0       3    male   True

In [6]:
titanic_nuevo.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   survived  891 non-null    int64
 1   pclass    891 non-null    int64
 2   sex       891 non-null    object
 3   alone     891 non-null    bool
dtypes: bool(1), int64(2), object(1)
memory usage: 21.9+ KB

In [9]:
titanic_nuevo2=pd.DataFrame()
titanic_nuevo2["sobrevivientes"]=pd.Categorical(titanic_nuevo["survived"])
titanic_nuevo2["clase"]=pd.Categorical(titanic_nuevo["pclass"])
titanic_nuevo2["genero"]=pd.Categorical(titanic_nuevo["sex"])
titanic_nuevo2["estado"]=pd.Categorical(titanic_nuevo["alone"])

In [10]:
titanic_nuevo2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   sobrevivientes  891 non-null    category
 1   clase           891 non-null    category
 2   genero          891 non-null    category
 3   estado          891 non-null    category
dtypes: category(4)
memory usage: 4.0 KB

In [12]:
tab_frec=pd.crosstab(
    index=titanic_nuevo2.sobrevivientes,
    columns="num_pasajeros"
)
tab_frec

col_0           num_pasajeros
sobrevivientes
0                         549
1                         342

In [13]:
tab_frec=pd.crosstab(
    index=titanic_nuevo2.clase,
    columns="num_pasajeros"
)
tab_frec

col_0  num_pasajeros
clase
1                216
2                184
3                491

In [15]:
tab_frec=pd.crosstab(
    index=titanic_nuevo2.estado,
    columns="num_pasajeros"
)
tab_frec

col_0   num_pasajeros
estado
False             354
True              537

In [16]:
tab_frec=pd.crosstab(
    index=titanic_nuevo2.sobrevivientes,
    columns="num_pasajeros"
    )
tab_frec.index=["con_familia","solo"]
tab_frec

col_0        num_pasajeros
con_familia            549
solo                   342

In [18]:
columna_porcentaje=tab_frec/tab_frec.sum()
columna_porcentaje*100

col_0        num_pasajeros
con_familia      61.616162
solo             38.383838

In [21]:
tab_frec=pd.crosstab(
    index=titanic_nuevo2.sobrevivientes,
    columns="num_pasajeros"
    )

tab_frec.index=["con_familia","solo"]
tab_frec["porcentaje"]=tab_frec/tab_frec.sum()*100

tab_frec.round(1)

col_0        num_pasajeros  porcentaje
con_familia            549        61.6
solo                   342        38.4

In [23]:
tab_frec=pd.crosstab(
    index=titanic_nuevo2.clase,
    columns="num_pasajeros"
    )

tab_frec.index=["primera","segunda","tercero"]
tab_frec["porcentaje"]=tab_frec/tab_frec.sum()*100

tab_frec.round(1)

col_0    num_pasajeros  porcentaje
primera            216        24.2
segunda            184        20.7
tercero            491        55.1

In [26]:
tab_frec=pd.crosstab(
    index=titanic_nuevo2.sobrevivientes,
    columns=titanic_nuevo2.clase,
    margins=True
    )

tab_frec

clase             1    2    3  All
sobrevivientes
0                80   97  372  549
1               136   87  119  342
All             216  184  491  891

In [28]:
tab_frec=pd.crosstab(
    index=titanic_nuevo2.sobrevivientes,
    columns=titanic_nuevo2.clase,
    margins=True
    )

tab_frec.index=["finados","sobrevivientes","total_clases"]
tab_frec.columns=["primera","segunda","tercera","total_sobrevivencia"]

tab_frec

                primera  segunda  tercera  total_sobrevivencia
finados              80       97      372                  549
sobrevivientes      136       87      119                  342
total_clases        216      184      491                  891

In [33]:
#frecuencias relativas globales
tab_frec1=tab_frec/tab_frec.loc["total_clases","total_sobrevivencia"]*100
tab_frec1.round(1)

                primera  segunda  tercera  total_sobrevivencia
finados             9.0     10.9     41.8                 61.6
sobrevivientes     15.3      9.8     13.4                 38.4
total_clases       24.2     20.7     55.1                100.0

In [34]:
#frecuencias relativas marginales por columna
tab_frec1=tab_frec/tab_frec.loc["total_clases"]*100
tab_frec1.round(1)

                primera  segunda  tercera  total_sobrevivencia
finados            37.0     52.7     75.8                 61.6
sobrevivientes     63.0     47.3     24.2                 38.4
total_clases      100.0    100.0    100.0                100.0

In [36]:
#frecuencias relativas marginales por filas
tab_frec1=tab_frec.T/tab_frec["total_sobrevivencia"]*100
tab_frec1.T.round(1)

                primera  segunda  tercera  total_sobrevivencia
finados            14.6     17.7     67.8                100.0
sobrevivientes     39.8     25.4     34.8                100.0
total_clases       24.2     20.7     55.1                100.0

In [53]:
#tablas de frecuencia cruzadas agrupadas

tab_frec10=pd.crosstab(
    index=titanic_nuevo2.sobrevivientes,
    columns=[titanic_nuevo2.genero,titanic_nuevo2.clase],
    margins=True
)

tab_frec10

genero         female          male            All
clase               1   2    3    1    2    3
sobrevivientes
0                   3   6   72   77   91  300  549
1                  91  70   72   45   17   47  342
All                94  76  144  122  108  347  891

In [60]:
marg_column=tab_frec10/tab_frec10.loc["All"]*100 #marginal por columnas
marg_column.round(1)

genero         female                 male                  All
clase               1      2      3      1      2      3
sobrevivientes
0                 3.2    7.9   50.0   63.1   84.3   86.5   61.6
1                96.8   92.1   50.0   36.9   15.7   13.5   38.4
All             100.0  100.0  100.0  100.0  100.0  100.0  100.0

In [65]:
marg_raw=tab_frec10.T/tab_frec10["All"]*100
marg_raw.T.round(1)

genero         female              male                All
clase               1     2     3     1     2     3
sobrevivientes
0                 0.5   1.1  13.1  14.0  16.6  54.6  100.0
1                26.6  20.5  21.1  13.2   5.0  13.7  100.0
All              10.5   8.5  16.2  13.7  12.1  38.9  100.0

In [68]:
#tablas de frecuencia cruzadas agrupadas

tab_frec10=pd.crosstab(
    index=titanic_nuevo2.sobrevivientes,
    columns=[titanic_nuevo2.genero,titanic_nuevo2.clase],
    margins=True
)

tab_frec10.index=["finado","vivo","total_genero_clase"]

tab_frec10.columns=["f_1","f_2","f_3","m_1","m_2","m_3", "total_sobrevivencia"]

tab_frec10

                    f_1  f_2  f_3  m_1  m_2  m_3  total_sobrevivencia
finado                3    6   72   77   91  300                  549
vivo                 91   70   72   45   17   47                  342
total_genero_clase   94   76  144  122  108  347                  891

In [77]:
frec_rel_gl=tab_frec10/tab_frec10.loc["total_genero_clase","total_sobrevivencia"]*100
frec_rel_gl.round(1)

                     f_1  f_2   f_3   m_1   m_2   m_3  total_sobrevivencia
finado               0.3  0.7   8.1   8.6  10.2  33.7                 61.6
vivo                10.2  7.9   8.1   5.1   1.9   5.3                 38.4
total_genero_clase  10.5  8.5  16.2  13.7  12.1  38.9                100.0